Revit 2026 API

# IFCCategoryTemplateUpdateCategoryList Method

---

Updates the mapping table with the categories from the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void UpdateCategoryList(
	Document document
)
```
```vb
Public Sub UpdateCategoryList (
	document As Document
)
```
```cpp
public:
void UpdateCategoryList(
	Document^ document
)
```
```fsharp
member UpdateCategoryList :
        document : Document -> unit
```

#### Parameters

document Document
     A Revit document to retrieve names from.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCCategoryTemplate Class

Autodesk.Revit.DB Namespace